БылковДА_70180166/src/Documents/ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности/ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности</name>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаПродления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКонтроля</name>
    <type>
      <types>EnumRef.НаименованиеКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрашиваемыйСрок</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриложенныеДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подтверждение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРассмотрения</name>
    <type>
      <types>EnumRef.СтатусРассмотрения</types>
    </type>
  </attributes>
</mdclass:Document>

БылковДА_70180166/src/Documents/ЗаявлениеНаПродлениеСроковЛиквидацииЗадолженности/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПриложенныеДокументыПриИзменении(Элемент)
    Если Объект.ПриложенныеДокументы = Истина Тогда
        Элементы.Подтверждение.Видимость = Истина;  
    Иначе
        // Если флаг снят - очищаем подтверждение и скрываем поле
        Объект.Подтверждение = Неопределено;
        Элементы.Подтверждение.Видимость = Ложь;
    КонецЕсли;
  КонецПроцедуры 

&НаКлиенте
Процедура ПодтверждениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
    ВыбратьФайл("Выбор подтверждающего документа", Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект));
КонецПроцедуры    

&НаКлиенте
Процедура ВыбратьФайл(ЗаголовокДиалога, Оповещение)  
    Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    Диалог.Заголовок = ЗаголовокДиалога;
    Диалог.Показать(Оповещение);  
КонецПроцедуры  

&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, Параметры) Экспорт
    Если ВыбранныеФайлы = Неопределено Или ВыбранныеФайлы.Количество() = 0 Тогда
        Возврат;
    КонецЕсли;

    ПутьКФайлу = ВыбранныеФайлы[0];
    Объект.Подтверждение = ПутьКФайлу; 
		
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеСтудента(СсылкаНаСтудента) Экспорт
    Результат = Неопределено;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    Студенты.Родитель КАК ПапкаСтудента,
    |    Студенты.Родитель.Наименование КАК НаименованиеПапки
    |ИЗ
    |    Справочник.Студенты КАК Студенты
    |ГДЕ
    |    Студенты.Ссылка = &СсылкаНаСтудента";
    
    Запрос.УстановитьПараметр("СсылкаНаСтудента", СсылкаНаСтудента);
    
    Попытка
        РезультатЗапроса = Запрос.Выполнить();
        Выборка = РезультатЗапроса.Выбрать();
        
        Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ПапкаСтудента) Тогда
            // Получаем наименование папки (родителя)
            НаименованиеПапки = Выборка.НаименованиеПапки;
            
            // Ищем группу с таким же наименованием
            Группа = НайтиГруппуПоНаименованию(НаименованиеПапки);
            
            Если Не ЗначениеЗаполнено(Группа) Тогда
                // Если точного совпадения нет, ищем по частичному
                Группа = НайтиГруппуПоЧастичномуСовпадению(НаименованиеПапки);
            КонецЕсли;
            
            Результат = Новый Структура;
            Результат.Вставить("ГруппаСсылка", Группа);
            Результат.Вставить("ГруппаНаименование", НаименованиеПапки);
        КонецЕсли;
    Исключение
		
	КонецПопытки;
    
    Возврат Результат;
КонецФункции

&НаСервере
Функция НайтиГруппуПоНаименованию(НаименованиеГруппы)
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ ПЕРВЫЕ 1
    |    Группы.Ссылка
    |ИЗ
    |    Справочник.Группы КАК Группы
    |ГДЕ
    |    ВЕРХ(Группы.Наименование) = ВЕРХ(&НаименованиеГруппы)";
    
    Запрос.УстановитьПараметр("НаименованиеГруппы", НаименованиеГруппы);
    
    Попытка
        РезультатЗапроса = Запрос.Выполнить();
        Выборка = РезультатЗапроса.Выбрать();
        
        Если Выборка.Следующий() Тогда
            Возврат Выборка.Ссылка;
        КонецЕсли;
    Исключение
      
    КонецПопытки;
    
    Возврат Неопределено;
КонецФункции

&НаСервере
Функция ПолучитьДанныеДисциплины(СсылкаНаДисциплину) Экспорт
    
    Результат = Новый Структура;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ ПЕРВЫЕ 1
    |    Дисциплины.НаименованиеКонтроля
    |ИЗ
    |    Справочник.Дисциплины КАК Дисциплины
    |ГДЕ
    |    Дисциплины.Ссылка = &СсылкаНаДисциплину";
    
    Запрос.УстановитьПараметр("СсылкаНаДисциплину", СсылкаНаДисциплину);
    
        РезультатЗапроса = Запрос.Выполнить();
        Выборка = РезультатЗапроса.Выбрать();
        
        Если Выборка.Следующий() Тогда
            Результат.Вставить("НаименованиеКонтроля", Выборка.НаименованиеКонтроля);
        КонецЕсли;
     
    Возврат Результат;
КонецФункции

&НаСервере
Функция НайтиГруппуПоЧастичномуСовпадению(НаименованиеГруппы)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ ПЕРВЫЕ 1
    |    Группы.Ссылка
    |ИЗ
    |    Справочник.Группы КАК Группы
    |ГДЕ
    |    Группы.Наименование ПОДОБНО &НаименованиеГруппы";
    
    Запрос.УстановитьПараметр("НаименованиеГруппы", "%"+НаименованиеГруппы+"%");
    
        РезультатЗапроса = Запрос.Выполнить();
        Выборка = РезультатЗапроса.Выбрать();
        
        Если Выборка.Следующий() Тогда
            Возврат Выборка.Ссылка;
        КонецЕсли;
     Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура СтудентПриИзменении(Элемент)
    Если Не ЗначениеЗаполнено(Объект.Студент) Тогда
        Объект.Группа = Неопределено;
        ЭтаФорма.Обновить();
        Возврат;
    КонецЕсли;
    
    ДанныеСтудента = ПолучитьДанныеСтудента(Объект.Студент);
    
    Если ДанныеСтудента <> Неопределено И ДанныеСтудента.Свойство("ГруппаСсылка") Тогда
        Объект.Группа = ДанныеСтудента.ГруппаСсылка;
    Иначе
        Объект.Группа = Неопределено;
        Сообщить("Не удалось определить группу для выбранного студента");
    КонецЕсли;
    
   КонецПроцедуры

&НаКлиенте
Процедура ДисциплинаПриИзменении(Элемент)
    Если Не ЗначениеЗаполнено(Объект.Дисциплина) Тогда
        Объект.НаименованиеКонтроля = Неопределено;
        Возврат;
    КонецЕсли;
    
    ДанныеДисциплины = ПолучитьДанныеДисциплины(Объект.Дисциплина);
    
    Если ДанныеДисциплины.Свойство("НаименованиеКонтроля") Тогда
        Объект.НаименованиеКонтроля = ДанныеДисциплины.НаименованиеКонтроля;
    Иначе
        Объект.НаименованиеКонтроля = Неопределено;
    КонецЕсли;
КонецПроцедуры
